#
# Taps
#
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "muesli/tap"

#
# Casks
#

# Browsers
cask "google-chrome"
cask "firefox"

# Chat / Email
cask "slack"

# Media
cask "spotify"
cask "macmediakeyforwarder"

# Developer Tools
cask "docker"
cask "visual-studio-code"
cask "iterm2"
cask "sourcetree"
cask "sequel-pro"
cask "gpg-suite"
cask "aws-vault"
cask "graphiql"
cask "stats"
cask "the-unarchiver"

# Fonts
cask "font-hack-nerd-font"
cask "font-hasklig"

# Utilities
cask "1password"
cask "1password-cli"
cask "onyx"
cask "bartender"
cask "caffeine"
cask "rectangle"
cask "alfred"

#
# Brews
#

# Unix tools
brew "coreutils"
brew "bat"
brew "gnu-sed"
brew "gnu-tar"
brew "tree"
brew "unzip"
brew "pidof"

# Dev Tools
brew "asdf"
brew "watch"
brew "make"
brew "jq"
brew "yq"
brew "tflint"
brew "awscli"
brew "dive"
brew "qrencode"
brew "pass"
brew "pass-otp"
brew "tldr"
brew "staticcheck"

# Shell
brew "fish"
brew "fisher"
brew "bash"
brew "starship"
brew "shellcheck"

# Git
brew "git"
brew "hub"
brew "diff-so-fancy"
brew "git-quick-stats"
brew "git-standup"
brew "git-recent"

# Network
brew "rsync"
brew "siege"
brew "curl"
brew "prettyping"
brew "telnet"
brew "wget"
brew "mtr"
brew "nmap"
brew "prettyping"
brew "vnstat"
brew "websocat"

# Monitoring
brew "ctop"
brew "htop"
brew "ncdu"
brew "btop"
brew "muesli/tap/duf"

# Fun
brew "cowsay"
brew "sl"

#
# Mac App Store Apps
#

brew "mas"
mas "Bear", id: 1091189122
mas "Microsoft To Do", id: 1274495053
mas "Spark", id: 1176895641
