#
# Taps
#
tap "homebrew/cask"
tap "homebrew/cask-fonts"

#
# Casks
#

# Browsers
cask "google-chrome"
cask "firefox"

# Apps
cask "sketch"
cask "notion"

# Media
cask "spotify"
cask "macmediakeyforwarder"

# Developer Tools
cask "docker"
cask "visual-studio-code"
cask "iterm2"
cask "sourcetree"
cask "macdown"
cask "sequel-pro"
cask "chef-workstation"
cask "java"
cask "kite"
cask "gpg-suite"

# Fonts
cask "font-hasklig"

# Utilities
cask "1password"
cask "onyx"
cask "bartender"
cask "caffeine"
cask "rectangle"
cask "alfred"

#
# Brews
#

# Unix tools
brew "bat"
brew "gnu-sed"
brew "gnu-tar"
brew "tree"
brew "unzip"

# Dev Tools
brew "asdf"
brew "watch"
brew "make"
brew "mas"
brew "jq"
brew "yq"
brew "tflint"
brew "ansible"

# Shell
brew "fish"
brew "starship"

# Git
brew "git"
brew "hub"
brew "diff-so-fancy"
brew "git-quick-stats"
brew "git-standup"

# Network
brew "rsync"
brew "siege"
brew "curl"
brew "prettyping"
brew "telnet"
brew "wget"

# Monitoring
brew "ctop"
brew "htop"
brew "ncdu"

# Fun
brew "cowsay"
brew "sl"

#
# Apps
#

